Revit 2024 API
ModelPath.ServerPath Property
 Whether this path is a server path (as opposed to a file path or cloud path)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool ServerPath { get; }
Visual Basic
Public ReadOnly Property ServerPath As Boolean
	Get
Visual C++
public:
property bool ServerPath {
	bool get ();
}
See Also
ModelPath Class
Autodesk.Revit.DB Namespace